CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/0/air/cloudCover
(
(    0   0.3   )
(    3600   0.3   )
(    7200   0.1   )
(    10800   0.5   )
(    14400   0.6   )
)
