CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/0/air/p
FoamFile
{
  version    2.0;
  format    ascii;
  class    volScalarField;
  location    "0/air";
  object    p;
}
dimensions    [1 -1 -2 0 0 0 0];
internalField    uniform 1e5;
boundaryField
{
  left
  {
    type    slip;
  }
  right
  {
    type    slip;
  }
  top
  {
    type    slip;
  }
  bottom
  {
    type    calculated;
    value    uniform 1e5;
  }
  back
  {
    type    calculated;
    value    uniform 1e5;
  }
  front
  {
    type    calculated;
    value    uniform 1e5;
  }
  tower
  {
    type    calculated;
    value    uniform 1e5;
  }
}
