CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/constant/IDN
(
(    0   755   )
(    3600   651   )
(    7200   671   )
(    10800   629   )
(    14400   597   )
)
