CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/constant/Idif
(
(    0   188   )
(    3600   227   )
(    7200   192   )
(    10800   149   )
(    14400   107   )
)
