CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/constant/air/momentumTransport
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    turbulenceProperties;
}
simulationType    RAS;
RAS
{
  RASModel    realizableKE;
  turbulence    on;
  printCoeffs    on;
}
