CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/constant/air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     0.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/air/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


7
(
    left
    {
        type            patch;
        nFaces          116;
        startFace       141165;
    }

    right
    {
        type            patch;
        nFaces          116;
        startFace       141281;
    }

    back
    {
        type            patch;
        nFaces          70;
        startFace       141397;
    }

    front
    {
        type            patch;
        nFaces          241;
        startFace       141467;
    }

    bottom
    {
        type            wall;
        inGroups        List<word> 0();
        nFaces          2135;
        startFace       141708;
    }

    top
    {
        type            patch;
        nFaces          521;
        startFace       143843;
    }

    tower
    {
        type            mappedWall;
        inGroups        List<word> 0();
        nFaces          5024;
        startFace       144364;
        sampleMode      nearestPatchFace;
        sampleRegion    tower;
        samplePatch     buildings_to_air;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

)


// ************************************************************************* //
