CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/constant/regionProperties
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  location    "constant";
  object    regionProperties;
}
regions
(
  fluid (air)
  vegetation (vegetation)
  solid (tower)
);
