CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/constant/tower/g
FoamFile
{
  version    2.0;
  format    ascii;
  class    uniformDimensionedVectorField;
  location    "constant";
  object    g;
}
dimensions    [0 1 -2 0 0 0 0];
value    ( 0 0 0 );
