CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/system/air/fvOptions
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  location    "constant";
  object    fvOptions;
}
limitT
{
  type    limitTemperature;
  selectionMode    all;
  min    273.15;
  max    350.15;
}
