CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/system/air/topoSetDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    topoSetDict;
}
actions
(
  {
    name    vegetation;
    type    cellSet;
    action    new;
    source    surfaceToCell;
    sourceInfo
    {
      file    "constant/triSurface/vegetation.stl";
      outsidePoints    ((110.77196731567383 192.48973083496094 11.97882251739502));
      includeCut    true;
      includeInside    true;
      includeOutside    false;
      nearDistance    -1;
      curvature    -100;
    }
  }
  {
    name    vegetation;
    type    cellZoneSet;
    action    new;
    source    setToCellZone;
    sourceInfo
    {
      set    vegetation;
    }
  }
);
