CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/system/blockMeshDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    blockMeshDict;
}
convertToMeters    1;
vertices
(
  (93.8 223.7 -1.629880605480416E-11)
  (93.8 161.2794616699219 -1.629880605480416E-11)
  (127.74393463134766 161.2794616699219 -1.629880605480416E-11)
  (127.74393463134766 223.7 -1.629880605480416E-11)
  (93.8 223.7 12.07882251739502)
  (93.8 161.2794616699219 12.07882251739502)
  (127.74393463134766 161.2794616699219 12.07882251739502)
  (127.74393463134766 223.7 12.07882251739502)
);
blocks
(
  hex (0 1 2 3 4 5 6 7)
  (
    4
    2
    1
  )
  simpleGrading (1 1 1)
);
edges
(
);
boundary
(
  left
  {
    type    patch;
    faces
    (
      (0 3 7 4)
    );
  }
  right
  {
    type    patch;
    faces
    (
      (1 5 6 2)
    );
  }
  back
  {
    type    patch;
    faces
    (
      (3 2 6 7)
    );
  }
  front
  {
    type    patch;
    faces
    (
      (0 4 5 1)
    );
  }
  bottom
  {
    type    wall;
    faces
    (
      (0 1 2 3)
    );
  }
  top
  {
    type    patch;
    faces
    (
      (4 7 6 5)
    );
  }
);
mergePatchPairs
(
);
