CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/system/decomposeParDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  location    "system";
  object    decomposeParDict;
}
method    scotch;
numberOfSubdomains    20;
scotchCoeffs
{
}
