CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/system/meshQualityDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    meshQualityDict;
}
#includeEtc    "caseDicts/mesh/generation/meshQualityDict.cfg";
minTetQuality    -1e+30;
maxBoundarySkewness    4;
minTwist    -1e+30;
maxConcave    80;
maxInternalSkewness    4;
nSmoothScale    4;
errorReduction    0.75;
relaxed
{
  maxNonOrtho    75;
}
