CR_Vegetation/14Nov2024_UMCF_CR-Vegfiles/UMCF_CRVS_05b/system/surfaceFeaturesDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    surfaceFeaturesDict;
}
surfaces    ("tower.stl" );
includedAngle    90;
subsetFeatures
{
  nonManifoldEdges    no;
  openEdges    yes;
}
#includeEtc    "caseDicts/surface/surfaceFeaturesDict.cfg";
